vlm/extension/Documents/СменноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СменноеЗадание</Name>
		</Properties>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/СменноеЗадание/Forms/ВыборОперацийДляДобавления/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	
	Если РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("бит_ЗаменаОборудования") Тогда
	
		//Кнопка
		Команда = ЭтаФорма.Команды.Добавить("бит_ЗаменитьОборудование");
		Команда.Действие = "бит_ЗаменитьОборудование";
		Команда.Заголовок = "(бит) Заменить оборудование";
		
		//Добавляем новую кнопку
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаменитьОборудование", Тип("КнопкаФормы"), Элементы.СписокКоманднаяПанель);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Заголовок = "(бит) Заменить оборудование";
		НовыйЭлемент.ИмяКоманды = "бит_ЗаменитьОборудование"; 
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаменитьОборудование(Команда)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	ТекущиеДанные = Элементы.Операции.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыделенныеСтроки = Элементы.Операции.ВыделенныеСтроки;
		
		АдресТЗОперации = ПолучитьТЗОперации(ВыделенныеСтроки);

		Если АдресТЗОперации <> Неопределено Тогда
			
			ОповещениеПриЗакрытииЗаменыОборудования = Новый ОписаниеОповещения("ОповещениеПриЗакрытииЗаменыОборудования", ЭтотОбъект, ТекущиеДанные.Этап);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("АдресТЗОперации", АдресТЗОперации);
			ОткрытьФорму("Обработка.ФормированиеСменныхЗаданий.Форма.бит_ФормаЗаменыОборудования", ПараметрыФормы, ЭтаФорма,,,,ОповещениеПриЗакрытииЗаменыОборудования,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		КонецЕсли;
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеПриЗакрытииЗаменыОборудования(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ВывестиСообщенияФормирования(Результат, ДополнительныеПараметры);
		
		//Элементы.Операции.Обновить();
	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ВывестиСообщенияФормирования(Результат, ТекущийЭтап)
				
	СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат);
	
	Ошибки = СтруктураРезультата.Ошибки;
	
	Для Каждого СтрокаОшибок Из Ошибки Цикл
		Если ЗначениеЗаполнено(СтрокаОшибок.Сообщения) Тогда
			
			Сообщить("Ошибка формирование этапа!");
			
			//СообщениеПользователю = Новый СообщениеПользователю;
			//СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			//СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			//СообщениеПользователю.Сообщить();
			
		КонецЕсли;
	КонецЦикла;
	
	РезультатФормирования = СтруктураРезультата.РезультатФормирования;
	
	СозданНовыйЭтап = Ложь;
	
	Для Каждого СтрокаРезультата Из РезультатФормирования Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.Документ) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			СообщениеПользователю.КлючДанных = СтрокаРезультата.Документ;
			СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			СообщениеПользователю.Сообщить();
			
			СозданНовыйЭтап = Истина;
						
		КонецЕсли;
	КонецЦикла;
	
	Если СозданНовыйЭтап Тогда
		
		ПричинаОтмены = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПричинаЗаменыОборудования, ЭтотОбъект, Истина);
		
		КоличествоОперации = 0;
		КоличествоСменноеЗадание = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2.Этап КАК Этап,
		|	СУММА(ПроизводственнаяОперация2_2.Количество) КАК КоличествоОперации,
		|	СУММА(0) КАК КоличествоСменноеЗадание
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|ГДЕ
		|	ПроизводственнаяОперация2_2.Этап = &Этап
		|	И ПроизводственнаяОперация2_2.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственнаяОперация2_2.Этап
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииКСозданиюСменныхЗаданий.Этап,
		|	СУММА(0),
		|	СУММА(ОперацииКСозданиюСменныхЗаданий.Количество)
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|ГДЕ
		|	ОперацииКСозданиюСменныхЗаданий.Этап = &Этап
		|	И ОперацииКСозданиюСменныхЗаданий.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииКСозданиюСменныхЗаданий.Этап";
		
		Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//КоличествоВОперациях = КоличествоВОперациях + ВыборкаДетальныеЗаписи.Количество;
			КоличествоОперации = КоличествоОперации + ВыборкаДетальныеЗаписи.КоличествоОперации;
			КоличествоСменноеЗадание = КоличествоСменноеЗадание + ВыборкаДетальныеЗаписи.КоличествоСменноеЗадание;
		КонецЦикла;
	
		СтарыйЭтапОбъект = ТекущийЭтап.ПолучитьОбъект();
		СтарыйЭтапОбъект.КоличествоУпаковокОтменено = СтарыйЭтапОбъект.КоличествоУпаковокПлан - КоличествоОперации  - КоличествоСменноеЗадание;
		//СтарыйЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
		СтарыйЭтапОбъект.бит_ЗамененНовымЭтапом = Истина;
		СтарыйЭтапОбъект.ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены);
		СтарыйЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//СтарыйЭтапОбъект.ПометкаУдаления = Истина;
		//СтарыйЭтапОбъект.Записать(); 
		
		//СообщениеПользователю = Новый СообщениеПользователю;
		//СообщениеПользователю.Текст = "Этап: " + Строка(ТекущийЭтап) + " помечен на удаление!";
		//СообщениеПользователю.КлючДанных = ТекущийЭтап;
		//СообщениеПользователю.УстановитьДанные(ТекущийЭтап);
		//СообщениеПользователю.Сообщить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииКСозданиюСменныхЗаданий.Подразделение КАК Подразделение,
		|	ОперацииКСозданиюСменныхЗаданий.СменноеЗадание КАК СменноеЗадание,
		|	ОперацииКСозданиюСменныхЗаданий.Этап КАК Этап,
		|	ОперацииКСозданиюСменныхЗаданий.Операция КАК Операция,
		|	ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации КАК ИдентификаторОперации,
		|	ОперацииКСозданиюСменныхЗаданий.Исполнитель КАК Исполнитель,
		|	ОперацииКСозданиюСменныхЗаданий.Участок КАК Участок,
		|	ОперацииКСозданиюСменныхЗаданий.РабочийЦентр КАК РабочийЦентр,
		|	ОперацииКСозданиюСменныхЗаданий.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ОперацииКСозданиюСменныхЗаданий.НазначатьНеРанее КАК НазначатьНеРанее
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|ГДЕ
		|	ОперацииКСозданиюСменныхЗаданий.Этап = &Этап
		|	И ОперацииКСозданиюСменныхЗаданий.СменноеЗадание = ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	
			НЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей();
			
			НЗ.Отбор.Подразделение.Установить(ВыборкаДетальныеЗаписи.Подразделение);
			НЗ.Отбор.СменноеЗадание.Установить(ВыборкаДетальныеЗаписи.СменноеЗадание);
			НЗ.Отбор.Этап.Установить(ВыборкаДетальныеЗаписи.Этап);
			НЗ.Отбор.Операция.Установить(ВыборкаДетальныеЗаписи.Операция);
			НЗ.Отбор.ИдентификаторОперации.Установить(ВыборкаДетальныеЗаписи.ИдентификаторОперации);
			НЗ.Отбор.Исполнитель.Установить(ВыборкаДетальныеЗаписи.Исполнитель);
			НЗ.Отбор.Участок.Установить(ВыборкаДетальныеЗаписи.Участок);
			НЗ.Отбор.РабочийЦентр.Установить(ВыборкаДетальныеЗаписи.РабочийЦентр);
			НЗ.Отбор.ВидРабочегоЦентра.Установить(ВыборкаДетальныеЗаписи.ВидРабочегоЦентра);
			НЗ.Отбор.НазначатьНеРанее.Установить(ВыборкаДетальныеЗаписи.НазначатьНеРанее);
			
			НЗ.Записать();
			
		КонецЦикла;
			
	КонецЕсли;
	
	Элементы.Операции.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗОперации(КлючиОпераций)
	
	Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОперацииТЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого Ключ Из КлючиОпераций Цикл
		
		НоваяСтрока = ОперацииТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ОперацииТЗ);
	
	Возврат Адрес;
	
КонецФункции
